ЛИС2/src/Catalogs/Водозаборы/Водозаборы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Водозаборы</name>
  <comment>В справочнике содержатся сведения об источниках водозабора предприятия.</comment>
  <attributes>
    <name>ПроектнаяПроизводительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВведенияВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭксплуатируетсяВНастоящееВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыСевернойШироты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыВосточнойДолготы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВодныйОбъект</name>
    <type>
      <types>DefinedType.ИсточникиПриемникиВод</types>
    </type>
  </attributes>
  <attributes>
    <name>РасстояниеОтУстья</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияКачестваВоды</name>
    <type>
      <types>CatalogRef.КатегорииКачестваВоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидВодВодозабора</name>
    <type>
      <types>EnumRef.Удалить_ВидВодВодозабораВыпуска</types>
    </type>
  </attributes>
  <attributes>
    <name>МуниципальныйРайон</name>
    <type>
      <types>CatalogRef.ОКТМО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКАТО</name>
    <type>
      <types>CatalogRef.ОКАТО</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТипаИсточникаПриемника</name>
    <type>
      <types>CatalogRef.КодыТипыИсточниковПриемников</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодохозяйственныйУчасток</name>
    <type>
      <types>CatalogRef.ВодохозяйственныеУчастки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственнаяПлощадка</name>
    <type>
      <types>CatalogRef.ПроизводственныеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>СобственностьСтороннейОрганизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПунктыНаблюденияТочкиЗамера</name>
    <attributes>
      <name>НомерСтвора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоордСевШир</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоордВостДолг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресПунктаЗамера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПриборыВодоучета</name>
    <attributes>
      <name>ПриборУчетаВоды</name>
      <type>
        <types>CatalogRef.ПриборыУчетаИспользованияВоды</types>
      </type>
    </attributes>
    <attributes>
      <name>Основной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЛИС2/src/Enums/ВидыВодногоОбъекта/ВидыВодногоОбъекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыВодногоОбъекта</name>
  <enumValues>
    <name>Море10</name>
  </enumValues>
  <enumValues>
    <name>Река20</name>
  </enumValues>
  <enumValues>
    <name>РекаПересыхающая21</name>
  </enumValues>
  <enumValues>
    <name>Озеро30</name>
  </enumValues>
  <enumValues>
    <name>ВодохранилищеРусловое40</name>
  </enumValues>
  <enumValues>
    <name>ВодохранилищеНаливное41</name>
  </enumValues>
  <enumValues>
    <name>Канал50</name>
  </enumValues>
  <enumValues>
    <name>Подземный60</name>
  </enumValues>
  <enumValues>
    <name>Шахта61</name>
  </enumValues>
  <enumValues>
    <name>Скважина62</name>
  </enumValues>
  <enumValues>
    <name>Коллектор71</name>
  </enumValues>
  <enumValues>
    <name>СетьКанализации91</name>
  </enumValues>
  <enumValues>
    <name>ЛивневойКоллектор99</name>
  </enumValues>
</mdclass:Enum>

ЛИС2/src/Catalogs/КодыТипыИсточниковПриемников/КодыТипыИсточниковПриемников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КодыТипыИсточниковПриемников</name>
  <comment>В справочнике содержится перечень кодов и типов источников/приемников воды согласно Приложению №1 приказа Росстата от 19.10.2009 N 230 (ред. от 28.11.2011, с изм. от 05.05.2016)</comment>
  <predefined>
    <items>
      <name>Болото</name>
      <description>Болото</description>
    </items>
    <items>
      <name>ВодохранилищеНаливноеПрудНаливной</name>
      <description>Водохранилище наливное, пруд наливной</description>
    </items>
    <items>
      <name>ВодохранилищеРусловоеПрудРусловой</name>
      <description>Водохранилище русловое, пруд русловой</description>
    </items>
    <items>
      <name>ЗемледельческиеПоляОрошения</name>
      <description>Земледельческие поля орошения</description>
    </items>
    <items>
      <name>КаналКомплексногоНазначения</name>
      <description>Канал комплексного назначения</description>
    </items>
    <items>
      <name>КоллекторОросительнойСистемы</name>
      <description>Коллектор оросительной системы</description>
    </items>
    <items>
      <name>ЛивневойКоллектор</name>
      <description>Ливневой коллектор</description>
    </items>
    <items>
      <name>Море</name>
      <description>Море</description>
    </items>
    <items>
      <name>Накопитель</name>
      <description>Накопитель</description>
    </items>
    <items>
      <name>Озеро</name>
      <description>Озеро</description>
    </items>
    <items>
      <name>ПодземныйВодныйОбъект</name>
      <description>Подземный водный объект</description>
    </items>
    <items>
      <name>ПоляФильтрации</name>
      <description>Поля фильтрации</description>
    </items>
    <items>
      <name>Река</name>
      <description>Река</description>
    </items>
    <items>
      <name>РекаПересыхающая</name>
      <description>Река пересыхающая</description>
    </items>
    <items>
      <name>РельефМестности</name>
      <description>Рельеф местности</description>
    </items>
    <items>
      <name>СетьКанализации</name>
      <description>Сеть канализации</description>
    </items>
    <items>
      <name>СкважинаВертикальнаяУровняГрунтовыхВод</name>
      <description>Скважина вертикального дренажа для понижения уровня грунтовых вод</description>
    </items>
    <items>
      <name>ШахтаРудникНефтепромыселКарьер</name>
      <description>Шахта, рудник, нефтепромысел, карьер</description>
    </items>
  </predefined>
</mdclass:Catalog>

ЛИС2/src/Catalogs/ВодныеОбъекты/ВодныеОбъекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВодныеОбъекты</name>
  <comment>В справочнике содержатся сведения о водных объектах.</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ВХУ</name>
    <type>
      <types>CatalogRef.ВодохозяйственныеУчастки</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВодногоОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидВодногоОбъекта</name>
    <type>
      <types>CatalogRef.КодыТипыИсточниковПриемников</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаПоДаннымГВР</name>
    <type>
      <types>EnumRef.ТипыВодныхОбъектовПоДаннымГВР</types>
    </type>
  </attributes>
  <attributes>
    <name>ОхраннаяЗона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВодосборнаяПлощадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Местоположение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаРеки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасстояниеОтУстьяДоВпадения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьВодоема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаВодотока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БассейновыйОкруг</name>
    <type>
      <types>CatalogRef.ВодохозяйственныеУчастки</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоГИ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТомаПоГИ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыпускПоГИ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассификацияВО</name>
    <type>
      <types>EnumRef.КлассификацияВодныхОбъектов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЛИС2/src/Catalogs/Водозаборы/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, "ГруппаКонтактнаяИнформация", ПоложениеЗаголовкаЭлементаФормы.Лево);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация	
	
	ВидОбъектаРека = Перечисления.ВидыВодногоОбъекта.Река20;
	УправлениеВидимостью(ЭтаФорма);
	
	ПриборыУчета.Параметры.УстановитьЗначениеПараметра("Владелец", Объект.Ссылка);
	
	// Работа с бизнес-процессами
	Если Обработки.СозданиеНСИ.ИспользоватьМеханизмБизнесПроцессов( Объект.Ссылка ) Тогда
		БП_ПоддержкаБизнесПроцессовСервер.ОбработатьОткрытиеФормаОбъекта( ЭтотОбъект );
		ЭтотОбъект.ТолькоПросмотр = Не Обработки.СозданиеНСИ.ЭлементДоступенДляРедактирования( Объект.Ссылка );
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	// Работа с бизнес-процессами
	Если Обработки.СозданиеНСИ.ИспользоватьМеханизмБизнесПроцессов( Объект.Ссылка ) Тогда
		Обработки.СозданиеНСИ.ПроверитьЗаполнениеРеквизитов( ЭтотОбъект, Отказ );
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере( ТекущийОбъект, ПараметрыЗаписи )
	
	// Работа с бизнес-процессами
	ПослеЗаписиОбъектаБизнесПроцессаНаСервере();
	
	ПриборыУчета.Параметры.УстановитьЗначениеПараметра("Владелец", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием( Отказ, СтандартнаяОбработка )
	
	// Работа с бизнес-процессами
	Если Не ЗакрыватьБезусловно И ЗадачаИсполнителяНеЗавершенаНаСервере() Тогда 
		текОповещение = Новый ОписаниеОповещения( "ПослеЗакрытияВопросаЗакрытиеФормы", ЭтотОбъект );	
		ПоказатьВопрос( текОповещение, "Отправить на согласование введенные данные о водозаборе '" + Объект.Ссылка + "'?", РежимДиалогаВопрос.ДаНет );

		Отказ				= Истина;
		ЗакрыватьБезусловно = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// 1С-КСУ Казанцев И.В. 15.06.17 9:50 Инициалиазция полей ВХУ, растояние от устья при выборе источника вод.
Процедура УстановитьВХУПоВОСервер()
	Если ЗначениеЗаполнено(Объект.ВодныйОбъект) Тогда
		Объект.ВодохозяйственныйУчасток = Объект.ВодныйОбъект.ВХУ;
		Объект.РасстояниеОтУстья = Объект.ВодныйОбъект.РасстояниеОтУстьяДоВпадения;
	Иначе
		Объект.ВодохозяйственныйУчасток = Неопределено;
		Объект.РасстояниеОтУстья = 0;
	КонецЕсли;	
КонецПроцедуры
// 1С-КСУ Казанцев И.В. 15.06.17 9:50 Инициалиазция полей ВХУ, растояние от устья при выборе источника вод. Конец.

&НаКлиенте
Процедура ВодныйОбъектПриИзменении(Элемент)
	УправлениеВидимостью(ЭтаФорма);
	
	// 1С-КСУ Казанцев И.В. 15.06.17 9:50 Инициалиазция полей ВХУ, растояние от устья при выборе источника вод.
	УстановитьВХУПоВОСервер();
	// 1С-КСУ Казанцев И.В. 15.06.17 9:50 Инициалиазция полей ВХУ, растояние от устья при выборе источника вод. Конец.
КонецПроцедуры

&НаКлиенте
Процедура КодТипаИсточникаВодоснабженияПриИзменении(Элемент)
	
	Если Объект.КодТипаИсточникаПриемника = ПредопределенноеЗначение("Справочник.КодыТипыИсточниковПриемников.ЛивневойКоллектор") Тогда 
		
		Объект.ВодныйОбъект          = ПредопределенноеЗначение("Справочник.ВодныеОбъекты.ПустаяСсылка");
		Объект.КатегорияКачестваВоды = ПредопределенноеЗначение("Справочник.КатегорииКачестваВоды.Ливневая");
		
	ИначеЕсли Объект.КодТипаИсточникаПриемника = ПредопределенноеЗначение("Справочник.КодыТипыИсточниковПриемников.СкважинаВертикальнаяУровняГрунтовыхВод") Тогда 
		
		Объект.КатегорияКачестваВоды = ПредопределенноеЗначение("Справочник.КатегорииКачестваВоды.КоллекторноДренажная");
		
	КонецЕсли;
	
	УправлениеВидимостью(ЭтаФорма);
	
КонецПроцедуры //Процедура КодТипаИсточникаВодоснабженияПриИзменении(Элемент) 

&НаКлиенте
Процедура КодКатегорииКачестваВодыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.КодТипаИсточникаПриемника) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для выбора категории качества воды необходимо выбрать код типа источника",, "Объект.КодТипаИсточникаПриемника");
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли; // Если Не ЗначениеЗаполнено(Объект.КодТипаИсточникаПриемника) Тогда
	
	СписокКатегорийПоКодуИсточника = ПолучитьКатегорииПоКодуТипаИсточника(Объект.КодТипаИсточникаПриемника);
	
	МассивПараметров = Новый Массив;
	
	Если СписокКатегорийПоКодуИсточника.Количество() > 0 Тогда 
		
		ПаметрВыбора = Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(СписокКатегорийПоКодуИсточника));
		
		МассивПараметров.Добавить(ПаметрВыбора);
	
	КонецЕсли; // Если МассивПараметров.Количество() > 0 Тогда
	
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
		
КонецПроцедуры //Процедура КодКатегорииКачестваВодыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
 
&НаКлиенте
Процедура ПриборыУчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СтруктураПараметры = Новый Структура("Владелец, Организация", Объект.Ссылка, Объект.Организация);
		
		// 1СКСУ - Казанцев И.В. 25.01.17 13:20
		// При проверке АПК не рекомендуется использовать функцию ПолучитьФорму(). Вместо нее рекомендуется ОткрытьФорму(). 
		// ФормаПрибора = ПолучитьФорму("Справочник.ПриборыУчетаИспользованияВоды.ФормаОбъекта",СтруктураПараметры);
		// ФормаПрибора.Открыть();
		
		ОткрытьФорму("Справочник.ПриборыУчетаИспользованияВоды.ФормаОбъекта",СтруктураПараметры,Элемент,УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		// 1СКСУ - Казанцев И.В. 25.01.17 13:20 Конец
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо сохранить Водозабор");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьКатегорииПоКодуТипаИсточника(КодТипаИсточникаПриемника)
	
	МассивКатегорийКачестваВоды = Новый Массив;
	
	Если КодТипаИсточникаПриемника = ПредопределенноеЗначение("Справочник.КодыТипыИсточниковПриемников.ШахтаРудникНефтепромыселКарьер") Тогда 
		
		МассивКатегорийКачестваВоды.Добавить(ПредопределенноеЗначение("Справочник.КатегорииКачестваВоды.Минеральная"));
		МассивКатегорийКачестваВоды.Добавить(ПредопределенноеЗначение("Справочник.КатегорииКачестваВоды.Термальная"));
	    МассивКатегорийКачестваВоды.Добавить(ПредопределенноеЗначение("Справочник.КатегорииКачестваВоды.ШахтноРудничная"));
	    МассивКатегорийКачестваВоды.Добавить(ПредопределенноеЗначение("Справочник.КатегорииКачестваВоды.Карьерная"));
		МассивКатегорийКачестваВоды.Добавить(ПредопределенноеЗначение("Справочник.КатегорииКачестваВоды.ЗабраннаяИзПриродныхВодныхОбъектовКромеМорей"));
		МассивКатегорийКачестваВоды.Добавить(ПредопределенноеЗначение("Справочник.КатегорииКачестваВоды.ЗабраннаяИЗПриродныхВОКромеМорейВТомЧислеПослеВодоподготовки"));
		МассивКатегорийКачестваВоды.Добавить(ПредопределенноеЗначение("Справочник.КатегорииКачестваВоды.ПолученнаяПереданнаяИзСистемВодоснабженияКоммунальногоНазначения"));
		МассивКатегорийКачестваВоды.Добавить(ПредопределенноеЗначение("Справочник.КатегорииКачестваВоды.ПолученнаяПереданнаяИзПрочихСистемВодоснабжения"));
		МассивКатегорийКачестваВоды.Добавить(ПредопределенноеЗначение("Справочник.КатегорииКачестваВоды.ПолученнаяПереданнаяИзСистемВодоснабженияВодообеспеченияОбводнения"));
		
	ИначеЕсли КодТипаИсточникаПриемника = ПредопределенноеЗначение("Справочник.КодыТипыИсточниковПриемников.СетьКанализации") Тогда	
		
		МассивКатегорийКачестваВоды.Добавить(ПредопределенноеЗначение("Справочник.КатегорииКачестваВоды.ВСистемахВодоотведенияКоммунальногоНазначения"));
		МассивКатегорийКачестваВоды.Добавить(ПредопределенноеЗначение("Справочник.КатегорииКачестваВоды.ВПрочихСистемахВодоотведения"));
	    МассивКатегорийКачестваВоды.Добавить(ПредопределенноеЗначение("Справочник.КатегорииКачестваВоды.БалластнаяЛьяльная"));
		
	КонецЕсли;
	
	Возврат МассивКатегорийКачестваВоды;
	
КонецФункции

// 1С-КСУ +++ Балацкий А.Н. 04.01.17
// По замечаниям отключен механизм управления видимостью элемента Расстояние от устья. 
// Независимо от кода типа источника - видимость = Истина.

//&НаСервереБезКонтекста
//Функция ПолучитьСписокВидовВодныхОбъектовРасстояниеДоУстья()
//	
//	//масСписокВидовВодныхОбъектов = Новый Массив;
//	//
//	//масСписокВидовВодныхОбъектов.Добавить( Справочники.КодыТипыИсточниковПриемников.Река );
//	//масСписокВидовВодныхОбъектов.Добавить( Справочники.КодыТипыИсточниковПриемников.ПодземныйВодныйОбъект );
//	//масСписокВидовВодныхОбъектов.Добавить( Справочники.КодыТипыИсточниковПриемников.ШахтаРудникНефтепромыселКарьер );
//	
//	Возврат Справочники.Водозаборы.ПолучитьСписокВидовВодныхОбъектовРасстояниеДоУстья();
//	
//КонецФункции

// 1С-КСУ --- Балацкий А.Н. 04.01.17

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостью(Форма)
	
	// 1С-КСУ +++ Балацкий А.Н. 04.01.17
	
	//ВидВодногоОбъекта = Форма.Объект.КодТипаИсточникаПриемника;
	//
	//масСписокВидовВодныхОбъектов = ПолучитьСписокВидовВодныхОбъектовРасстояниеДоУстья();
	//
	//Форма.Элементы.РасстояниеОтУстья.Видимость = ( масСписокВидовВодныхОбъектов.Найти( ВидВодногоОбъекта ) <> Неопределено );	//(ВидВодногоОбъекта = Форма.ВидОбъектаРека);
	//
	//Если НЕ Форма.Элементы.РасстояниеОтУстья.Видимость Тогда
	//	Форма.Объект.РасстояниеОтУстья = 0;
	//КонецЕсли;
	
	// 1С-КСУ --- Балацкий А.Н. 04.01.17
	
	Если Форма.Объект.КодТипаИсточникаПриемника = ПредопределенноеЗначение("Справочник.КодыТипыИсточниковПриемников.ЛивневойКоллектор") Тогда
		Форма.Элементы.ВодныйОбъект.Доступность             = Ложь;
		Форма.Элементы.КодКатегорииКачестваВоды.Доступность = Ложь;
	ИначеЕсли Форма.Объект.КодТипаИсточникаПриемника = ПредопределенноеЗначение("Справочник.КодыТипыИсточниковПриемников.СкважинаВертикальнаяУровняГрунтовыхВод") Тогда	
		Форма.Элементы.ВодныйОбъект.Доступность             = Истина;
		Форма.Элементы.КодКатегорииКачестваВоды.Доступность = Ложь;
	Иначе
		Форма.Элементы.ВодныйОбъект.Доступность             = Истина;
		Форма.Элементы.КодКатегорииКачестваВоды.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Поддержка контактной информации.

// СтандартныеПодсистемы.КонтактнаяИнформация
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
	УправлениеКонтактнойИнформациейКлиент.ПредставлениеПриИзменении(ЭтотОбъект, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Результат = УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
	Подключаемый_ОбновитьКонтактнуюИнформацию(Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
	Результат = УправлениеКонтактнойИнформациейКлиент.ПредставлениеОчистка(ЭтотОбъект, Элемент.Имя);
	Подключаемый_ОбновитьКонтактнуюИнформацию(Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
	Результат = УправлениеКонтактнойИнформациейКлиент.ПодключаемаяКоманда(ЭтотОбъект, Команда.Имя);
	Подключаемый_ОбновитьКонтактнуюИнформацию(Результат);
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуВводаАдреса(ЭтотОбъект, Результат);
КонецПроцедуры

&НаСервере
Функция Подключаемый_ОбновитьКонтактнуюИнформацию(Результат = Неопределено)
	Возврат УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
КонецФункции

#КонецОбласти

// Работа с бизнес-процессами
#Область ФункцииБизнесПроцессов

&НаКлиенте
Процедура ВыполнитьЗадачу( Команда ) Экспорт
	
	Если Модифицированность Тогда
		текОповещение = Новый ОписаниеОповещения( "ПослеЗакрытияВопросаЗаписи", ЭтотОбъект, Команда );	
		ПоказатьВопрос( текОповещение, "Для выполнения операции объект должен быть записан. Записать?", РежимДиалогаВопрос.ДаНет );		
	Иначе
		стрКомментарий = "";
		
		текОповещение  = Новый ОписаниеОповещения( "ПослеВводаКомментария", ЭтотОбъект );	
		
		ПоказатьВводСтроки( текОповещение, стрКомментарий, "Введите комментарий выполненой задачи" );
		
		ЗавершитьЗадачуНаСервере( Команда.Имя );
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаЗаписи( Результат, Команда ) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда 
		Записать();
		ВыполнитьЗадачу( Команда );
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаЗакрытиеФормы( Результат, ДополнительныеПараметры ) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда 
		текКомандаВыполнения = ПолучитьКомандуВыполнения();
		Если текКомандаВыполнения <> Неопределено Тогда 
			ВыполнитьЗадачу( текКомандаВыполнения );
		КонецЕсли;
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаКомментария( фпКомментарий, фпПараметры ) Экспорт
	
	Если Не ПустаяСтрока( фпКомментарий ) Тогда
		УстановитьКомментарийЗадачиНаСервере( ЭтотОбъект.БП_ВыполняемаяЗадача, фпКомментарий );	
	КонецЕсли;
	
	Если Открыта() Тогда 
		Закрыть();
	КонецЕсли;
	
	Оповестить( "БП_ВыполнениеЗадачи", Объект.Ссылка );
	
КонецПроцедуры

&НаКлиенте
Процедура БП_ВыполнитьЗадачу( Команда )
	
	БП_ПоддержкаБизнесПроцессовКлиент.ВыполнитьЗадачу( ЭтотОбъект, Команда );
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКомандуВыполнения()
	
	Для Каждого текКоманда Из Команды Цикл 	
		Если текКоманда.Действие = "БП_ВыполнитьЗадачу" Тогда 
			Возврат текКоманда;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ЗадачаИсполнителяНеЗавершенаНаСервере()
	
	Возврат ( Элементы.Найти( "БП_ВыполняемаяЗадача" ) <> Неопределено И
		 	  Не ЭтотОбъект["БП_ВыполняемаяЗадача"].Выполнена И
		 	  ЭтотОбъект["БП_ВыполняемаяЗадача"].ТочкаМаршрута.Порядок = 1 );
	
КонецФункции

&НаСервере
Процедура ЗапуститьБизнесПроцессСогласованияНаСервере()
	
	Обработки.СозданиеНСИ.ЗапуститьБизнесПроцессСогласования( Объект.Ссылка );
	
	БП_ПоддержкаБизнесПроцессовСервер.ОбработатьОткрытиеФормаОбъекта( ЭтотОбъект );
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиОбъектаБизнесПроцессаНаСервере()
	
	Если Обработки.СозданиеНСИ.ИспользоватьМеханизмБизнесПроцессов( Объект.Ссылка ) Тогда
		ЗапуститьБизнесПроцессСогласованияНаСервере();
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ЗавершитьЗадачуНаСервере( фпИмяКоманды )

	текНомер  = Сред( фпИмяКоманды, 12 );
	текСтатус = ЭтаФорма["БП_Статус" + текНомер];
	
	БП_ПоддержкаБизнесПроцессовСервер.ЗавершитьЗадачу( ЭтотОбъект.БП_ВыполняемаяЗадача, ЭтотОбъект.БП_ВыполняемаяЗадача.БизнесПроцесс, текСтатус );

	Обработки.СозданиеНСИ.УстановитьРеквизитыПоБизнесПроцессу( ЭтотОбъект.БП_ВыполняемаяЗадача, Объект.Ссылка );
	
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура УстановитьКомментарийЗадачиНаСервере( фпЗадача, фпКомментарий )
	
	Обработки.СозданиеНСИ.УстановитьРеквизитКомментарий( фпЗадача, фпКомментарий );
	
КонецПроцедуры

#КонецОбласти
